#include <stdio.h>
#include <stdlib.h>
#include <time.h>

#define N 10  // розмір масиву

int main() {
    int dig[N];
    int i, j, mm, max, tmp;

    // Ініціалізація генератора випадкових чисел
    srand(time(0));

    // Заповнення масиву випадковими числами від -50 до 50
    for (i = 0; i < N; i++) {
        dig[i] = rand() % 101 - 50;  // генеруємо число від -50 до 50
    }

    // Виведення початкового масиву
    puts("Old array:");
    for (i = 0; i < N; i++) {
        printf("%4d ", dig[i]);
    }
    printf("\n");

    // Сортування масиву за спаданням методом вибору максимального елемента
    for (i = N - 1; i >= 1; i--) {
        max = dig[0];  // припустимо, що перший елемент - максимальний
        mm = 0;        // індекс максимального елемента
        for (j = 1; j <= i; j++) {
            if (dig[j] > max) {  // знайти максимальний елемент
                max = dig[j];
                mm = j;
            }
        }
        // Обмін місцями максимального елемента та останнього елемента в невідсортованій частині масиву
        tmp = dig[i];
        dig[i] = max;
        dig[mm] = tmp;
    }

    // Виведення відсортованого масиву
    puts("Sorted array (descending):");
    for (i = 0; i < N; i++) {
        printf("%4d ", dig[i]);
    }
    printf("\n");

    return 0;
}
